// 06.VarInitialize.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    // 변수기본문법인 초기화에 대해서 알아보겠습니다.

    // 이건 선언
    // 선언의 개념은 어떠한 메모리를 할당해서 쓰겠다는것을 명시한것을 말합니다.
    // int 이 자료형을 정수로서 표현한다는것까지 자료형에 존재하는것.
    // 연산자가 함수에서 어떻게 처리할지가 자료형을 통해서 결정되기 때문입니다.
    // 메모리의 자료형에 의해서 결정나게 된다.
    // "안녕" + "하세요";
    // 10 + 20;
    // 그래서 철저하게 프로그램은 타입에 기반해서 어떠한 연산처리가 이루어질지가 결정되므로
    // 자료형은 너무나도 중요한 요소입니다.
    // 10 + "하세요";

    // 건강한 습관.
    int Value = 10; // 메모리가 만들어지자마자 값을 넣어주는 것을 초기화
    Value = 10; // 대입.

    // 둘은 정말정말 정말 어마어마하게 차이가 있습니다.
    // 자료형이 만들어졌을대 
    // 초기화를 안하는건 죄악.
    // 초기화는 무조건 해줘야 합니다. <= 무조건무조건무조건

    // 그리고 나서 사용하면 됩니다.




    
}
