// 35.Object.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

// 이건 사용자 정의 자료형
// 클래스는 객체를 만들기 위한 기본 틀
// 플레이어가 메모리화 되면 어떤 녀석이 되어야해.
// 객체의 설계도 라고 할수 있다.
class Player 
{

};

class Monster
{

};

int main()
{
    // 'a'
    // 기본자료형
    int NewInt;
    // 정수가 할수 있는 행동이 뭐가 있고
    // 메모리가 어떻게 구성되는지에 대해서 이미 다 

    // 메모리화되어서 무언가를 하기위해서는 2가지가 필요합니다.
    // 1. 맴버변수(속성) 명사
    //    공격력
    //    방어력
    //  
    // 2. 맴버함수(행동) 동사
    //    공격한다
    //    맞는다.
    //    레벨업한다.
    Player NewPlayer;
}
